load-tests/basic.yml
config:
  target: "http://127.0.0.1:4001"
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      rampTo: 20
      name: Spike phase
  plugins:
    custom:
      path: "./e2e/playwright-runner.cjs"

scenarios:
  - name: Playwright Scenario
    flow:
      - function: "runPlaywrightTest"